#include <iostream>
#include <windows.h>

using namespace std;

void hanoi(int i, int k, int n) {
    if (n == 1) {
        cout << "Переместить диск 1 с " << i << " на " << k << " стержень" << endl;
    }
    else {
        int tmp = 6 - i - k; 

        hanoi(i, tmp, n - 1); 
        cout << "Переместить диск " << n << " с " << i << " на " << k << " стержень" << endl; 
        hanoi(tmp, k, n - 1); 
    }
}

int main() {
    SetConsoleOutputCP(1251);
    SetConsoleCP(1251);

    int n = 0, i = 0, k = 0;

    cout << "Введите количество дисков: ";
    if (!(cin >> n) || n <= 0) {
        cout << "Ошибка: Количество дисков должно быть целым числом больше 0!\n";
        return 1;   
    }

    cout << "Введите номер начального стержня (1, 2 или 3): ";
    if (!(cin >> i) || i < 1 || i > 3) {
        cout << "Ошибка: Номер начального стержня должен быть в диапазоне от 1 до 3.\n";
        return 1;
    }

    cout << "Введите номер конечного стержня (1, 2 или 3): ";
    if (!(cin >> k) || k < 1 || k > 3) {
        cout << "Ошибка: Номер конечного стержня должен быть в диапазоне от 1 до 3.\n";
        return 1;
    }

    if (i == k) {
        cout << "Начальный и конечный стержни совпадают. Перекладывать ничего не нужно!\n";
        return 0;
    }

    cout << "\nПоследовательность действий для перекладывания дисков:" << endl;
    hanoi(i, k, n);

    return 0; 
}